{
  "backend/main.mo": "Motoko canister managing user profiles, authorization, prices, and paper‑trading operations with admin‑restricted price updates and per‑user state.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels for the Aurex project.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their purpose and functionality within the Aurex app.",
  "frontend/index.css": "Tailwind CSS configuration defining design tokens, color variables, and light/dark theme styles for the frontend UI.",
  "frontend/index.html": "Root HTML file mounting the Aurex React app and loading the main TypeScript entry module.",
  "frontend/src/App.tsx": "Main React application shell handling authentication, routing, theme, layout, and page rendering for the Aurex simulator.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate component that blocks access until Internet Identity finishes loading and the user is logged in.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for initializing a user profile, capturing a name and creating a profile with default values.",
  "frontend/src/components/branding/AboutSection.tsx": "Displays Aurex information including leadership, mission, and platform description.",
  "frontend/src/components/branding/AurexBrand.tsx": "Renders the Aurex logo and branding header with icon.",
  "frontend/src/components/DisclaimerBanner.tsx": "UI banner displaying a warning that Aurex is a simulated paper‑trading platform using virtual money only.",
  "frontend/src/components/formatters/money.ts": "Utility functions to format bigint amounts into standard or compact USD strings.",
  "frontend/src/components/navigation/MainNav.tsx": "Tab-based navigation bar for switching between dashboard, trade, portfolio, and history pages.",
  "frontend/src/components/prices/PriceManager.tsx": "Component to view and update the current price of a symbol with validation and mutation handling.",
  "frontend/src/hooks/mutations/usePlaceMarketOrder.ts": "Hook for placing market orders and invalidating related portfolio and history queries.",
  "frontend/src/hooks/mutations/useSaveCallerUserProfile.ts": "Hook to save the current user's profile and refresh profile data.",
  "frontend/src/hooks/mutations/useUpdatePrice.ts": "Hook for updating a price and invalidating price-related queries.",
  "frontend/src/hooks/queries/useAllPrices.ts": "Fetches the full list of prices when an actor is available.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Fetches and exposes the logged-in user's profile with loading state adjustments.",
  "frontend/src/hooks/queries/useHoldings.ts": "Retrieves the user's current holdings from the backend.",
  "frontend/src/hooks/queries/usePortfolioValuation.ts": "Fetches the user's portfolio valuation from the backend.",
  "frontend/src/hooks/queries/usePrice.ts": "Fetches the price for a specific symbol when available.",
  "frontend/src/hooks/queries/useTradeHistory.ts": "Retrieves the user's trade history via their profile.",
  "frontend/src/hooks/useActor.ts": "Manages creation and lifecycle of the backend actor tied to Internet Identity and triggers query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login flow, and identity persistence.",
  "frontend/src/index.css": "Tailwind base styles plus Aurex theme variables, background, and dark mode definitions.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and mounting the app.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user profile and portfolio valuation stats with loading skeletons and an account summary section.",
  "frontend/src/pages/HistoryPage.tsx": "Fetches and displays executed trade history in a table with loading states and profit/loss formatting.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows current holdings enriched with live prices and total portfolio value, with loading skeletons.",
  "frontend/src/pages/TradePage.tsx": "Provides a form to place market buy or sell orders with validation, error handling, and price management.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Defines the current Aurex project state, listing existing implemented features and pending feature requests for the paper‑trading app. Includes metadata like schema version, project version, and requirement mappings."
}